class ºØ¾î»§Æ² 
{
	String ³»¿ë¹°;
	ºØ¾î»§Æ²(){
		³»¿ë¹° = "ÆÏ";
		System.out.println("¾Ó²¿°¡ " + ³»¿ë¹° + "ÀÎ ºØ¾î»§ÀÌ »ý¼ºµÆ´Ù");
	}
	ºØ¾î»§Æ²(String ¾Ó²¿){
		³»¿ë¹° = ¾Ó²¿;
		System.out.println("¾Ó²¿°¡ " + ³»¿ë¹° + "ÀÎ ºØ¾î»§ÀÌ »ý¼ºµÆ´Ù2");
	}		
	void ¹èºÎ¸£°ÔÇÕ´Ï´Ù(){
		System.out.println("¹èºÎ¸£°ÔÇÕ´Ï´Ù");
	}
}

class B
{
	public static void main(String[] args) {
		ºØ¾î»§Æ² ºØ¾î»§1 = new ºØ¾î»§Æ²();
		ºØ¾î»§Æ² ºØ¾î»§2 = new ºØ¾î»§Æ²("½´Å©¸²");

		
		System.out.println("Ã¹¹øÂ° ºØ¾î»§Àº ³»¿ë¹°ÀÌ" + ºØ¾î»§1.³»¿ë¹°+"ÀÌ°í, µÎ¹øÂ° ºØ¾î»§Àº ³»¿ë¹°ÀÌ "+ºØ¾î»§2.³»¿ë¹°+ "ÀÌ´Ù");
		ºØ¾î»§1.¹èºÎ¸£°ÔÇÕ´Ï´Ù();
		ºØ¾î»§2.¹èºÎ¸£°ÔÇÕ´Ï´Ù();
	}
}
